# Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой,
#  а некоторые – гербом. Определите минимальное число монеток, которые нужно
#  перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной.
#  Выведите минимальное количество монет, которые нужно перевернуть.

# n = int(input("Укажите количество монет: "))
# min = 0
# for i in range(n):
#     a = int(input('Ввод "0" или "1": ')) - числа будет вводить пользователь
#     if a == 0 :
#         min += 1 
# if min < n / 2 :  
#     print(min)
# else:
#     print(n - min)   


# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница.
#  Петя помогает Кате по математике. Он задумывает два натуральных числа
#  X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки.
#  Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать 
#  задуманные Петей числа.

# S = int(input("Сумма загаданных чисел: "))
# P = int(input("Произведение загаданных чисел: "))
# X = int()
# Y = int()
# for i in range(1, 1000):
#     for k in range(1, 1000):
#             if (i + k == S) and (i * k == P):
#                 print(f"X = {i}, Y = {k}")

               
# Задача 14: Требуется вывести все целые степени двойки (т.е. числа вида 2k),
#  не превосходящие числа N.

# n = int(input("Введите число N: "))
# m = 1    -  (2 в нулевой степени)
# while m <= n:
#     print(m, end = ',')
#     m = m * 2 - ( степени числа 2)


    

    

